In [2]:
import numpy as np
import pandas as pd

In [23]:
x = ["ahab","b","c"]

In [26]:
arr = np.array([7,4,5])

In [27]:
ser1 = pd.Series(arr,x)

In [31]:
y = ['a', 'b','c']

In [32]:
ser2 = pd.Series(np.array([1,2,3]),y)

In [36]:
ser1.argmax()

0

In [116]:
df = pd.DataFrame(np.random.randn(5,5),['a','b','c','d','e'],['f','g','h','i','j'])

In [69]:
df.drop('a',inplace=True)

In [83]:
df.loc[['a','c'],['g','j','h']]

          g         j         h
a -0.831921 -0.071592  1.188065
c  2.182599  0.253553  0.976224

In [93]:
df[df['g']>0][['g','h','i']]

          g         h         i
c  2.182599  0.976224  0.058589
d  0.807835 -0.795694 -0.429818

In [97]:
df[(df['g']>0) | (df['i']>0)]

          f         g         h         i         j
a  1.019092 -0.831921  1.188065  0.740542 -0.071592
b -0.411199 -0.232148 -1.073032  0.392484  0.643498
c  0.081173  2.182599  0.976224  0.058589  0.253553
d  0.362733  0.807835 -0.795694 -0.429818 -1.539774

In [117]:
df.reset_index()

  index         f         g         h         i         j
0     a  2.576388 -0.071445  0.255243  1.114522 -0.187020
1     b -1.342242  0.309352  1.614968 -0.789881 -0.392786
2     c -0.179543  0.066664 -0.445663  2.053877  0.571582
3     d -1.947064 -0.390708  0.898299 -0.230611 -0.472147
4     e  0.580088 -0.816556 -1.250836 -0.182401  0.137265

In [118]:
states = 'NA ID MS HE JA'

In [119]:
df['States'] = states.split()

In [127]:
df.set_index('States',inplace=True)

KeyError: "None of ['States'] are in the columns"

In [128]:
df

               f         g         h         i         j
States
NA      2.576388 -0.071445  0.255243  1.114522 -0.187020
ID     -1.342242  0.309352  1.614968 -0.789881 -0.392786
MS     -0.179543  0.066664 -0.445663  2.053877  0.571582
HE     -1.947064 -0.390708  0.898299 -0.230611 -0.472147
JA      0.580088 -0.816556 -1.250836 -0.182401  0.137265

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [30]:
df.loc['G1'].loc[3]['A']

1.0995786975600672

In [26]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=['Groups', 'Num'])

In [25]:
df.index.names = ['Groups','Num']

In [29]:
df

                   A         B
Groups Num
G1     1    0.089261  0.960958
       2   -0.584480 -0.752588
       3    1.099579  0.266005
G2     1    0.189122 -0.177756
       2    0.461616  2.721612
       3    0.390568  1.018384

In [39]:
d = {'A':[1,5,np.nan],'B':[np.nan, np.nan,6],'C':[7,8,9]}

In [40]:
df = pd.DataFrame(d)

In [43]:
df.dropna(axis =1,thresh=3)

   C
0  7
1  8
2  9

In [47]:
df.fillna(value = 1,limit=1)

     A    B  C
0  1.0  1.0  7
1  5.0  NaN  8
2  1.0  6.0  9

In [48]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [66]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [62]:
byCp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [67]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [88]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[0, 1, 2, 3])

In [94]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'E': ['D8', 'D9', 'D10', 'D11']},
                        index=[0, 1, 2, 3])

In [95]:
pd.concat([df1,df2,df3], axis =0)

     A    B    C    D    E
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
3   A3   B3   C3   D3  NaN
0   A4   B4   C4   D4  NaN
1   A5   B5   C5   D5  NaN
2   A6   B6   C6   D6  NaN
3   A7   B7   C7   D7  NaN
0   A8   B8   C8  NaN   D8
1   A9   B9   C9  NaN   D9
2  A10  B10  C10  NaN  D10
3  A11  B11  C11  NaN  D11

In [82]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [117]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']},
                    index=['o','p','q','r'])
   
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']},
                    index=['o','p','q','r'])

  key   A   B
o  K0  A0  B0
p  K1  A1  B1
q  K2  A2  B2
r  K3  A3  B3

In [118]:
left.join(right)

  key   A   B   C   D
o  K0  A0  B0  C0  D0
p  K1  A1  B1  C1  D1
q  K2  A2  B2  C2  D2
r  K3  A3  B3  C3  D3

In [119]:
def times2(x):
    return x**2

In [130]:
df1 = pd.DataFrame({'A':[1,2,3,4]})

In [144]:
df1.sort_values(by='A',ascending=False)

   A
3  4
2  3
1  2
0  1

In [141]:
df2.drop('A',axis=1)

    B   C   D
0  B4  C4  D4
1  B5  C5  D5
2  B6  C6  D6
3  B7  C7  D7

In [145]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [147]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [148]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1